# Combining DataFrames in pandas

##### - Concatenation <br/>
##### - Inner Merge <br/>
##### - Left & Right Merge <br/>
##### - outer Merge <br/>

#### concatenation

In [34]:
# Concatenation --> combining together two dataframes tables of same format in clomns, NB - we can concatenate two df on rows 

# .concat() method

import numpy as np
import pandas as pd

In [8]:

data_one = {'A':['a0','a1','a2','a3'], 'B':['b0','b1','b2','b3'] }

data_two = {'C':['c0','c1','c2','c3'], 'D':['d0','d1','d2','d3'] }

In [9]:

one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)  # create pandas df one & two out python dict data

In [10]:
one

    A   B
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3

In [11]:
two

    C   D
0  c0  d0
1  c1  d1
2  c2  d2
3  c3  d3

In [13]:
#concatenate along column --->  since both df has same index position

pd.concat([one, two], axis = 1)  # ---> concatenate one & two in column same df table

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [15]:
pd.concat([two, one], axis = 1)

    C   D   A   B
0  c0  d0  a0  b0
1  c1  d1  a1  b1
2  c2  d2  a2  b2
3  c3  d3  a3  b3

In [16]:
# concatenate in rows

one

    A   B
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3

In [17]:
two

    C   D
0  c0  d0
1  c1  d1
2  c2  d2
3  c3  d3

In [21]:

pd.concat([one, two], axis = 0)  # ---> concatenate one & two in rows, 
                     
# NB --->***pandas also fills in half of row data wit NULL to signify a difference between A,B column and C,D column in df one & two, thus repeats the index 0 t0 3 for one & then for two

     A    B    C    D
0   a0   b0  NaN  NaN
1   a1   b1  NaN  NaN
2   a2   b2  NaN  NaN
3   a3   b3  NaN  NaN
0  NaN  NaN   c0   d0
1  NaN  NaN   c1   d1
2  NaN  NaN   c2   d2
3  NaN  NaN   c3   d3

In [26]:
# relabeled column in rows concatenate of two df - one & two ---> by renaming column of df same as othe

two.columns = one.columns  # ---> rename column of table two same as table one keeping it original value, eg - we learnt that column A, B is same property of C, D

two

    A   B
0  c0  d0
1  c1  d1
2  c2  d2
3  c3  d3

In [28]:
pd.concat([one, two], axis=0)  # ---> concatenate df table one & two into single df table with column A & B with 8 rows but have duplicate index

    A   B
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3
0  c0  d0
1  c1  d1
2  c2  d2
3  c3  d3

In [33]:
# reindex - duplicate index in row conctenate of two df with same index

mydf = pd.concat([one, two], axis=0)

In [35]:
mydf.index

RangeIndex(start=0, stop=8, step=1)

In [36]:
mydf.index = range(len(mydf))

In [37]:
mydf

    A   B
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3
4  c0  d0
5  c1  d1
6  c2  d2
7  c3  d3

In [38]:
thr = two

In [39]:
thr

    A   B
0  c0  d0
1  c1  d1
2  c2  d2
3  c3  d3

In [41]:
pd.concat([thr, two], axis=1)

    A   B   A   B
0  c0  d0  c0  d0
1  c1  d1  c1  d1
2  c2  d2  c2  d2
3  c3  d3  c3  d3

#### Merge
>  - Inner Merge <br/>
>  - Left or Right Merge <br/>
>  - Outer Merge <br/>

##### Inner Merge

In [35]:
# Inner Merge ----> we use merge method to join/ concatenate two df table when their is different

# .merge() method ---> same as in JOIN methods in SQL

registration = pd.DataFrame({'reg_id':[1,2,3,4], 'name':['bob','dilon','adam','henry']})

login = pd.DataFrame({'login_id':[1,2,3,4], 'name':['adam','parker','henry','xixiang']})   # ---> creating registration & login df table

In [36]:
registration

   reg_id   name
0       1    bob
1       2  dilon
2       3   adam
3       4  henry

In [37]:
login

   login_id     name
0         1     adam
1         2   parker
2         3    henry
3         4  xixiang

In [38]:
pd.merge(registration, login, on='name', how='inner')  # ---> inner merge between registration & login with *on (should be a column, uqinue & common on two table  ) 

# NB - for inner join/merge, we are taking only datas presents in both table

   reg_id   name  login_id
0       3   adam         1
1       4  henry         3

In [60]:
# help(pd.merge) ---> doc on pd.merge()

##### Left or Right Merge

In [40]:
#NB :- order of table pass in as args matters ---> first table is Left one & second table paas in is the Right one

registration

   reg_id   name
0       1    bob
1       2  dilon
2       3   adam
3       4  henry

In [41]:
login

   login_id     name
0         1     adam
1         2   parker
2         3    henry
3         4  xixiang

In [42]:
# Left Merge --> eg: - taking login table as the Left table

pd.merge(login, registration, on='name', how='left')  # --> returns name column with all names in left login table with its login_id 
                                                    #& some NULL in reg_id column  of right registration table for names not prests in login table

   login_id     name  reg_id
0         1     adam     3.0
1         2   parker     NaN
2         3    henry     4.0
3         4  xixiang     NaN

In [43]:
#Right Merge ---> opposite of left meerge - i.e all datas (on **column) in right table must be present

pd.merge(login, registration, on='name', how='right')

   login_id   name  reg_id
0       NaN    bob       1
1       NaN  dilon       2
2       1.0   adam       3
3       3.0  henry       4

In [68]:
#NB --> i.e Right Merge, rifht table set the course for result output & vice versa for Left Merge

##### Outer Merge

In [44]:
# Outer Merge ---> merge everything present in both pandas df tables

registration

   reg_id   name
0       1    bob
1       2  dilon
2       3   adam
3       4  henry

In [45]:
login

   login_id     name
0         1     adam
1         2   parker
2         3    henry
3         4  xixiang

In [46]:
pd.merge(registration, login, how='outer', on='name')  #---> grabs all the names in both table & fill in NUll value for datas not available

   reg_id     name  login_id
0     3.0     adam       1.0
1     1.0      bob       NaN
2     2.0    dilon       NaN
3     4.0    henry       3.0
4     NaN   parker       2.0
5     NaN  xixiang       4.0

In [47]:
pd.merge(login, registration, how='outer', on='name') # ---> i.e, same like inner merge, order dont matter in outer merge

   login_id     name  reg_id
0       1.0     adam     3.0
1       NaN      bob     1.0
2       NaN    dilon     2.0
3       3.0    henry     4.0
4       2.0   parker     NaN
5       4.0  xixiang     NaN

#####  Joining on index

In [48]:
registration

   reg_id   name
0       1    bob
1       2  dilon
2       3   adam
3       4  henry

In [49]:
registration = registration.set_index('name')  # ---> set name column as the index of registration table

In [50]:
registration

       reg_id
name
bob         1
dilon       2
adam        3
henry       4

In [51]:
login

   login_id     name
0         1     adam
1         2   parker
2         3    henry
3         4  xixiang

In [52]:
# join registration & login table ---> i.e we have to specify we want to join on name index in regis table & column name in login table

pd.merge(registration, login, left_index=True, right_on='name', how='inner')  # --> joins index & column in two df tables

   reg_id  login_id   name
0       3         1   adam
2       4         3  henry

##### deal with different key column names in joined df tabkes

In [53]:
registration

       reg_id
name
bob         1
dilon       2
adam        3
henry       4

In [55]:
registration = registration.reset_index()  # ---> reset index name back to colum

registration

    name  reg_id
0    bob       1
1  dilon       2
2   adam       3
3  henry       4

In [57]:
registration.columns = ['reg_name', 'reg_id']  # rename --> name column to reg_name

In [58]:
registration

  reg_name  reg_id
0      bob       1
1    dilon       2
2     adam       3
3    henry       4

In [59]:
login

   login_id     name
0         1     adam
1         2   parker
2         3    henry
3         4  xixiang

In [65]:

result = pd.merge(registration, login, how='inner', left_on='reg_name', right_on='name')  # inner join---> have to specific mention of column name on both table

In [66]:
result  #NB - returns both clumns even though they represent same values

  reg_name  reg_id  login_id   name
0     adam       3         1   adam
1    henry       4         3  henry

In [67]:
result.drop('reg_name', axis=1)  # ---> drops duplicate column reg_name from result

   reg_id  login_id   name
0       3         1   adam
1       4         3  henry

In [69]:
# add or tag duplicate columns in pandas

registration.columns = ['name', 'id'] #---> rename column name to name & id 

registration

    name  id
0    bob   1
1  dilon   2
2   adam   3
3  henry   4

In [70]:
login

   login_id     name
0         1     adam
1         2   parker
2         3    henry
3         4  xixiang

In [71]:
login.columns = ['id', 'name']  # --> rename column name to id & name

login

   id     name
0   1     adam
1   2   parker
2   3    henry
3   4  xixiang

In [72]:
pd.merge(registration, login, how='inner', on='name')    # --> inner join on name column, *** pandas automatically level id column as id_x & id_y

    name  id_x  id_y
0   adam     3     1
1  henry     4     3

In [74]:
pd.merge(registration, login, how='inner', on='name', suffixes=('_reg', '_log'))  # ---> we can also provide our suffix for common column name, eg - id

    name  id_reg  id_log
0   adam       3       1
1  henry       4       3

In [76]:
# Thats it for combining dataframes in pandas :)